{
  "meta": { "locale": "en" }
  , "firstName": "Deysi"
  , "lastName": "Ortega"
  , "email": "deysio@gmail.com"
  , "mobile": "+(34) 651 630 278"
  , "web": "[http://volodymyrprokopyuk.github.io/newcv/cv-deysi.html](http://volodymyrprokopyuk.github.io/newcv/cv-deysi.html)"
  , "address": "Parla, Madrid"
  , "objective": "Customer Support Coordinator"
  , "summary": "Over 10 years of success experience in Customer Support and Customer Care. Results-oriented professional with excellent analytical skills. Masterful employee trainer and team builder. Focused on Customer Satisfaction with distinguished interpersonal skills. Competency in Customer Service Quality Management and Customer Relationship Management. Knowledge Management expertise. Strong IT proficiency with profound communication skills. Highly organized with attention to detail and focus on results. MBA, BSc Telecommunications degree and fluent English"
  , "formats": {
    "pdf": "[PDF](https://www.dropbox.com/s/2qwab9btjghllrq/cv-deysi.pdf?dl=0)"
    , "html": "[HTML](http://volodymyrprokopyuk.github.io/newcv/cv-deysi.html)"
    , "txt": "[TXT](https://www.dropbox.com/s/t475m3pkvb0q1qy/cv-deysi.txt?dl=0)" }
  , "education": [
     { "degree": "Master of Business Administration, MBA"
       , "description": "Strategy, project management, marketing, accounting and finance, human resources. Business plans"
       , "school": {
         "name": "[Escuela de Administración de Empresas, EAE](http://www.eae.es/)"
         , "location": "Madrid" }
       , "from": "2012-09-01", "to": "in course" }
     , { "degree": "ITIL V3 (Information Technology Infrastructure Library)"
       , "description": "Set of practices for IT Service Management that focuses on aligning IT Services with the needs of business"
       , "school": {
         "name": "[GARBEN](http://www.garben.com/)"
         , "location": "Madrid" }
       , "from": "2011-09-01", "to": "2011-12-01" }
     , { "degree": "Amadeus Flight Reservation System"
       , "description": "Amadeus Flight Reservation functional and transactional workflows"
       , "school": {
         "name": "[Amadeus](http://www.amadeus.com/)"
         , "location": "Madrid" }
       , "from": "2009-05-01", "to": "2009-06-01" }
     , { "degree": "Electronics and Telecommunications Engineer, BSc"
       , "description": "Electronics and Telecommunications"
       , "school": {
         "name": "[National Polytechnic School](http://www.epn.edu.ec/)"
         , "location": "Quito, Ecuador" }
       , "from": "1999-10-01", "to": "2003-03-01" } ]
  , "employment": [
    { "position": "Second Level Technical Support"
      , "company": {
        "name": "[Amadeus IT Group](http://www.amadeus.com/)"
        , "location": "Madrid"
        , "description": "World's leading IT provider for the global travel and tourism industry" }
      , "from": "2007-03-01", "to": "current"
      , "accomplishments": [
         { "role": "Promotions", "competencies": [
           "Promoted 3 times in 7 years: from First Level Technical Support (2007) to Second Level Technical Support (2008) to Second Level Technical Support directly at Amadeus (2015) mainly due to high personal commitment to Amadeus' excellence and success"
           , "Consistently received highest rating on annual reviews" ] }
         , { "role": "Customer Relationships Manager", "competencies": [
           "Increased customer satisfaction with proven success in building and managing customer relationships with major Amadeus clients in collaboration with Commercial Department confirming exceptional communication and negotiation skills"
           , "Received many thank you letters from Amadeus clients due to careful management and resolution of customer complaints by using superior skills in complaint and escalation management" ] }
         , { "role": "Customer Service Quality Manager", "competencies": [
           "Contributed to Customer Support Quality Certification ITC (ISO 9001) by composing and publishing proposals for continuous improvement of Customer Support Service Quality; very good in elaborating, documenting and sharing ideas" ] }
         , { "role": "Customer Support Staff Trainer", "competencies": [
           "Delivered a high number of training sessions for first level Customer Support staff for products and services provided by Amadeus, as well as for operating systems, network administration and configuration. Demonstrated deep skills for staff training, organization and socializing" ] }
         , { "role": "Knowledge Manager", "competencies": [
           "Extended and improved knowledge management processes by creating and delivering over 40+ technical support manuals and step-by-step incident resolution procedures. High commitment to innovation and optimization of knowledge and information. Competency in clear definition and explanation of technical solutions" ] }
         , { "role": "Problem Solver", "competencies": [
           "Efficiency and productivity in remote diagnosis and troubleshooting of technical issues at corporate customer level; applying innovative and proactive methodologies; demonstrating strong skills in problem analysis and solution, multi-tasking and multi-issue resolution" ] }
         , { "role": "Analytical Thinker", "competencies": [
           "Improved Customer Support Service Quality by tracking the resolution progress of technical issues and by running weekly/monthly reports on common trends to identify, report and resolve underlying problems in the efficacy of provided Customer Service" ] } ] }
    , { "position": "Teleoperator. Customer Care"
      , "company": {
        "name": "[Transcom for Orange](http://www.transcom.com/)"
        , "location": "Madrid"
        , "description": "Transcom is a global customer experience specialist, providing customer care, sales, technical support and credit management services through our extensive network of contact centers and work-at-home agents" }
      , "from": "2004-06-01", "to": "2007-03-01"
      , "accomplishments": [
        { "role": "Promotions Manager", "competencies": [
          "Managed different promotion campaigns and discount application to Orange customers manifesting communication skills, and Customer Care competencies" ] }
        , { "role": "Payment Operator", "competencies": [
          "Performed numerous telephonic payment operations, manipulating payment information, account details, credit cards and banking operations and proving organizational skills, attention to details and Customer Care competencies" ] } ] } ]
  , "skills": [
    { "domain": "Customer Support & Care"
      , "competencies": [ "Over 10 years of experience in Customer Support & Care. Increased customer satisfaction and improved Customer Support Service Quality by applying innovative methodologies and proactive approach in attending each customer issue" ] }
    , { "domain": "Communication"
      , "competencies": [ "Coordinated issue resolution process between Technical Department, Functional Specialists, Operational Staff and Commercial Managers demonstrating superior communication and interpersonal skills"
        , "Presented common trends in underlying problems to managers and clearly explained technical issues to Customer Support staff by analyzing issue tracking and reporting information" ] }
    , { "domain": "Customer Relationship Management"
      , "competencies": [ "Increased Customer satisfaction by managing Customer relationship in collaboration with Commercial Department" ] }
    , { "domain": "Complaint Management"
      , "competencies": [ "Received a high number of thank you letters from Amadeus clients due to careful management and resolution of customer complaints by using superior skills in complaint and escalation management" ] }
    , { "domain": "Staff Technology Training"
      , "competencies": [ "Delivered many Customer Support staff training courses confirming reliable organizational and communication skills" ] }
    , { "domain": "Knowledge Management"
      , "competencies": [ "Extended and improved knowledge management processes by creating and delivering over 40+ technical support manuals and step-by-step incident resolution procedures. High commitment to innovation and optimization of knowledge and information. Competency in clear definition and explanation of technical solutions" ] }
    , { "domain": "IT Expertise & Advisory"
      , "competencies": [ "Resolved numerous complex technical issues related with operating system/networking and Amadeus products and solutions confirming strong technical expertise, deep knowledge of Amadeus products and IT advisory competencies" ] }
    , { "domain": "Issue Diagnostic & Troubleshooting"
      , "competencies": [ "Performed remote diagnostic & troubleshooting of over 4700+ complex technical issues (Customer Service requests) per year using innovative applications (Team Viewer, NetOp Remote Control, CRM) and methodologies demonstrating high competency in using multichannel e-Support facilities for incident resolution" ] }
    , { "domain": "Issue Tracking & Reporting"
      , "competencies": [ "Executed issue monitoring & reporting of over 4700+ incidents per year using tracking applications (SIEBEL, One ViewX) and proactive approaches in information analysis manifesting proved analytical and reporting skills" ] }
    , { "domain": "Languages"
      , "competencies": [
        "English --- fluent"
        , "Spanish --- mother tongue" ] } ]
  , "targets": [
    { "position": "Customer Support Coordinator, Amadeus", "showx": "all"
      , "requirements": [
        { "requirement": "Operational Management"
          , "competency": "Efficiency and productivity in remote diagnosis and troubleshooting of technical issues at corporate customer level; applying innovative and proactive methodologies; demonstrating strong skills in problem analysis and solution, multi-tasking and multi-issue resolution" }
        , { "requirement": "Excellence in Customer Service"
          , "competency": "Contributed to Customer Support Quality Certification ITC (ISO 9001) by composing and publishing proposals for continuous improvement of Customer Support Service Quality; very good in elaborating, documenting and sharing ideas" }
        , { "requirement": "Processes and Tools, Quality and Improvements"
          , "competency": "Improved Customer Support Service Quality by tracking the resolution progress of technical issues and by running weekly/monthly reports on common trends to identify, report and resolve underlying problems in the efficacy of provided Customer Service" }
        , { "requirement": "Communication, Collaboration and Knowledge Management"
          , "competency": "Extended and improved knowledge management processes by composing and delivering over 40+ technical support manuals and step-by-step incident resolution procedures description confirming high commitment to innovation and optimization of knowledge management and information sharing with excellent competency to explain technical solutions clearly" }
        , { "requirement": "Coordination of Travel Assistance Service"
          , "competency": "Successfully delivered technical support to all PCs of Travel Assistance Service Centers proving deep knowledge of technical and operational processes in the Service Center" } ] } ]
}
